In [15]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

In [16]:
df = pd.read_csv("train.csv")

In [19]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
type(df[["Age"]])

pandas.core.frame.DataFrame

In [33]:
type(df[["Name"]])

pandas.core.frame.DataFrame

In [35]:
df.loc[[0,5,10] , ["Age", "Sex"]]

     Age     Sex
0   22.0    male
5    NaN    male
10   4.0  female

In [36]:
df.loc[("Age" > 60) & ("Age" < 10)]

TypeError: '>' not supported between instances of 'str' and 'int'